---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepPreheatHotwaterLoop
source: html/a3dcbdba-46a1-cfd4-9464-4045abb92549.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepPreheatHotwaterLoop Property

"Preheat Hot Water Loop"

## Syntax (C#)
```csharp
public static ForgeTypeId MepPreheatHotwaterLoop { get; }
```